function [output] = jacobian_Function(x)
%JACOBIAN_FUNCTION 此处显示有关此函数的摘要
%   此处显示详细说明
% output = (sin(2*pi*(x/4 + 3/4))^2 + 1)*(x/8 - 1/8) + (pi*cos(pi*(x/4 + 3/4))*sin(pi*(x/4 + 3/4)))/2 + pi*cos(2*pi*(x/4 + 3/4))*sin(2*pi*(x/4 + 3/4))*(x/4 - 1/4)^2;

%levy
% output = [(x(1)/8 - 1/8)*(10*sin(pi*(x(1)/4 + 3/4) + 1)^2 + 1) + (pi*cos(pi*(x(1)/4 + 3/4))*sin(pi*(x(1)/4 + 3/4)))/2 + 5*pi*cos(pi*(x(1)/4 + 3/4) + 1)*sin(pi*(x(1)/4 + 3/4) + 1)*(x(1)/4 - 1/4)^2; (sin(2*pi*(x(2)/4 + 3/4))^2 + 1)*(x(2)/8 - 1/8) + pi*cos(2*pi*(x(2)/4 + 3/4))*sin(2*pi*(x(2)/4 + 3/4))*(x(2)/4 - 1/4)^2];

%自拟合函数
% output = 9.0623*cos(0.69125*x) - 20.465*cos(0.5925*x) - 1.8501*cos(0.29625*x) + 1.2869*sin(0.29625*x) + 1.6981*sin(0.5925*x) + 0.87967*cos(0.09875*x) + 0.48131*cos(0.1975*x) + 5.1705*cos(0.395*x) + 5.9345*cos(0.79*x) + 17.108*sin(0.69125*x) + 1.3035*sin(0.09875*x) - 4.0053*sin(0.1975*x) + 6.6637*sin(0.395*x) - 11.376*sin(0.79*x) - 0.66854*cos(0.49375*x) - 14.482*sin(0.49375*x);

output = cos(x - (3*cos(x))/2)*((3*sin(x))/2 + 1) - sin(2*x - 2*sin(x))*(2*cos(x) - 2);

end

